Функция ЭтоТекстовыйФайл(ИмяФайла) Экспорт
	Файл = Новый Файл(ИмяФайла);
	Если НРег(Файл.Расширение) = ".txt" Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции


Функция ЯвляетсяКартинкой(ИмяФайла) Экспорт
	РасширенияКартинок = Новый Массив(4);


	РасширенияКартинок.Добавить(".png");


	РасширенияКартинок.Добавить(".jpeg");


	РасширенияКартинок.Добавить(".jpg");


	РасширенияКартинок.Добавить(".bmp");





	Файл = Новый Файл(ИмяФайла);


	Если РасширенияКартинок.Найти(НРег(Файл.Расширение)) <> Неопределено Тогда


		Возврат Истина;


	КонецЕсли;





	Возврат Ложь;


КонецФункции