&НаКлиенте
Процедура ВидПриИзменении(Элемент)
  УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()

  Если Объект.Вид = ПредопределенноеЗначение("Справочник.ВидыДокументов.Договор") Тогда
    Элементы.Контрагент.АвтоОтметкаНезаполненного = Истина;
    Элементы.КонтактноеЛицо.АвтоОтметкаНезаполненного = Истина;
  Иначе
    Элементы.Контрагент.АвтоОтметкаНезаполненного = Ложь;
    Элементы.КонтактноеЛицо.АвтоОтметкаНезаполненного = Ложь;
  КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
  УправлениеФормой();
КонецПроцедуры