
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ РольДоступна("Админ") Тогда
		Элементы.ДатаФактическогоВыполнения.Доступность = Ложь;
	КонецЕсли;
	Элементы.ПроверкаПройдена.Видимость = 
	Объект.ТочкаМаршрута = БизнесПроцессы.Исполнение.ТочкиМаршрута.Проверка;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()
	Возврат РаботаСПользователями.ПолучитьТекущегоПользователя();
КонецФункции

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	Объект.ДатаФактическогоВыполнения = ТекущаяДата();
	Объект.ФактическийИсполнитель = ПолучитьТекущегоПользователя();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверкаПройденаПриИзмененииНаСервере(БП, ПроверкаПройдена)
	БП1 = БП.ПолучитьОбъект();
	БП1.ПроверкаПройдена = ПроверкаПройдена;
	БП1.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПройденаПриИзменении(Элемент)
	ПроверкаПройденаПриИзмененииНаСервере(Объект.БизнесПроцесс, ПроверкаПройдена);
КонецПроцедуры
