
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗатратыПоПроектам Расход
	Движения.ЗатратыПоПроектам.Записывать = Истина;
	Движение = Движения.ЗатратыПоПроектам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Проект = Проект;
	Движение.Сумма = 0;
	Для Каждого ТекСтрокаТабличнаяЧастьФактическиеРасходы Из ТабличнаяЧастьФактическиеРасходы Цикл
		Движение.Сумма = Движение.Сумма + ТекСтрокаТабличнаяЧастьФактическиеРасходы.СуммаРасхода;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
